In [193]:
import pandas as pd

In [194]:
f = pd.DataFrame([[1,2,3]], columns=['a', 'b', 'c'])
f

   a  b  c
0  1  2  3

In [195]:
f.loc[1] = [1,1,1]
f.loc[11] = [11,11,11]
f.loc[42] = [42,42,42]
f

     a   b   c
0    1   2   3
1    1   1   1
11  11  11  11
42  42  42  42

In [196]:
d = {"a": 1, "x-b": 2, "c": 99}
f.loc[99] = d
f

       a     b     c
0    1.0   2.0   3.0
1    1.0   1.0   1.0
11  11.0  11.0  11.0
42  42.0  42.0  42.0
99   1.0   NaN  99.0

In [197]:
f.loc[99] = ['a', 42, False]
f2 = f.drop([1, 11])
f2

     a     b      c
0    1   2.0      3
42  42  42.0     42
99   a  42.0  False

In [198]:
last_row = f.tail(1)
f2 = f.drop(last_row.index)
f2

     a     b   c
0    1   2.0   3
1    1   1.0   1
11  11  11.0  11
42  42  42.0  42

In [199]:
first_rows = f.head(2)

f2 = f.drop(first_rows.index)
f2

     a     b      c
11  11  11.0     11
42  42  42.0     42
99   a  42.0  False

In [200]:
d = f.to_dict()
d

{'a': {0: 1.0, 1: 1.0, 11: 11.0, 42: 42.0, 99: 'a'},
 'b': {0: 2.0, 1: 1.0, 11: 11.0, 42: 42.0, 99: 42.0},
 'c': {0: 3.0, 1: 1.0, 11: 11.0, 42: 42.0, 99: False}}

In [201]:
d['b'][100] = 100
f = pd.DataFrame(d)
f

       a      b      c
0      1    2.0      3
1      1    1.0      1
11    11   11.0     11
42    42   42.0     42
99     a   42.0  False
100  NaN  100.0    NaN

In [202]:
f2 = f[(f.b > 39) | (f.c == 3)]
f2

       a      b      c
0      1    2.0      3
42    42   42.0     42
99     a   42.0  False
100  NaN  100.0    NaN

In [203]:
f2 = f.copy()
f2['c'] = f2['c'].apply(lambda x: x*2)
f2

       a      b     c
0      1    2.0   6.0
1      1    1.0   2.0
11    11   11.0  22.0
42    42   42.0  84.0
99     a   42.0   0.0
100  NaN  100.0   NaN

In [204]:
f['b'].min()

1.0

In [205]:
f['a'].value_counts()

1.0     2
a       1
11.0    1
42.0    1
Name: a, dtype: int64

In [206]:
f['null?'] = f['a'].notnull()
f

       a      b      c  null?
0      1    2.0      3   True
1      1    1.0      1   True
11    11   11.0     11   True
42    42   42.0     42   True
99     a   42.0  False   True
100  NaN  100.0    NaN  False

In [236]:
g = f.groupby('a')
g.first()

         b      c null?
a
1.0    2.0      3  True
11.0  11.0     11  True
42.0  42.0     42  True
a     42.0  False  True

In [237]:
f.shape

(6, 4)